Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/regs/sec_eng_reg.h
/* 0x234 : se_trng_0_ctrl_3 */
#define SEC_ENG_SE_TRNG_0_CTRL_3_OFFSET (0x234)
#define SEC_ENG_SE_TRNG_0_CP_RATIO      SEC_ENG_SE_TRNG_0_CP_RATIO
#define SEC_ENG_SE_TRNG_0_CP_RATIO_POS  (0U)
#define SEC_ENG_SE_TRNG_0_CP_RATIO_LEN  (8U)
#define SEC_ENG_SE_TRNG_0_CP_RATIO_MSK  (((1U << SEC_ENG_SE_TRNG_0_CP_RATIO_LEN) - 1) << SEC_ENG_SE_TRNG_0_CP_RATIO_POS)
#define SEC_ENG_SE_TRNG_0_CP_RATIO_UMSK (~(((1U << SEC_ENG_SE_TRNG_0_CP_RATIO_LEN) - 1) << SEC_ENG_SE_TRNG_0_CP_RATIO_POS))
#define SEC_ENG_SE_TRNG_0_HT_RCT_C      SEC_ENG_SE_TRNG_0_HT_RCT_C
#define SEC_ENG_SE_TRNG_0_HT_RCT_C_POS  (8U)
#define SEC_ENG_SE_TRNG_0_HT_RCT_C_LEN  (8U)
#define SEC_ENG_SE_TRNG_0_HT_RCT_C_MSK  (((1U << SEC_ENG_SE_TRNG_0_HT_RCT_C_LEN) - 1) << SEC_ENG_SE_TRNG_0_HT_RCT_C_POS)
#define SEC_ENG_SE_TRNG_0_HT_RCT_C_UMSK (~(((1U << SEC_ENG_SE_TRNG_0_HT_RCT_C_LEN) - 1) << SEC_ENG_SE_TRNG_0_HT_RCT_C_POS))
#define SEC_ENG_SE_TRNG_0_HT_APT_C      SEC_ENG_SE_TRNG_0_HT_APT_C
#define SEC_ENG_SE_TRNG_0_HT_APT_C_POS  (16U)
#define SEC_ENG_SE_TRNG_0_HT_APT_C_LEN  (10U)
#define SEC_ENG_SE_TRNG_0_HT_APT_C_MSK  (((1U << SEC_ENG_SE_TRNG_0_HT_APT_C_LEN) - 1) << SEC_ENG_SE_TRNG_0_HT_APT_C_POS)
#define SEC_ENG_SE_TRNG_0_HT_APT_C_UMSK (~(((1U << SEC_ENG_SE_TRNG_0_HT_APT_C_LEN) - 1) << SEC_ENG_SE_TRNG_0_HT_APT_C_POS))
#define SEC_ENG_SE_TRNG_0_HT_OD_EN      SEC_ENG_SE_TRNG_0_HT_OD_EN
#define SEC_ENG_SE_TRNG_0_HT_OD_EN_POS  (26U)
#define SEC_ENG_SE_TRNG_0_HT_OD_EN_LEN  (1U)
#define SEC_ENG_SE_TRNG_0_HT_OD_EN_MSK  (((1U << SEC_ENG_SE_TRNG_0_HT_OD_EN_LEN) - 1) << SEC_ENG_SE_TRNG_0_HT_OD_EN_POS)
#define SEC_ENG_SE_TRNG_0_HT_OD_EN_UMSK (~(((1U << SEC_ENG_SE_TRNG_0_HT_OD_EN_LEN) - 1) << SEC_ENG_SE_TRNG_0_HT_OD_EN_POS))
#define SEC_ENG_SE_TRNG_0_ROSC_EN       SEC_ENG_SE_TRNG_0_ROSC_EN
#define SEC_ENG_SE_TRNG_0_ROSC_EN_POS   (31U)
#define SEC_ENG_SE_TRNG_0_ROSC_EN_LEN   (1U)
#define SEC_ENG_SE_TRNG_0_ROSC_EN_MSK   (((1U << SEC_ENG_SE_TRNG_0_ROSC_EN_LEN) - 1) << SEC_ENG_SE_TRNG_0_ROSC_EN_POS)
#define SEC_ENG_SE_TRNG_0_ROSC_EN_UMSK  (~(((1U << SEC_ENG_SE_TRNG_0_ROSC_EN_LEN) - 1) << SEC_ENG_SE_TRNG_0_ROSC_EN_POS))

/* 0x240 : se_trng_0_test_out_0 */
#define SEC_ENG_SE_TRNG_0_TEST_OUT_0_OFFSET (0x240)
#define SEC_ENG_SE_TRNG_0_TEST_OUT_0        SEC_ENG_SE_TRNG_0_TEST_OUT_0
#define SEC_ENG_SE_TRNG_0_TEST_OUT_0_POS    (0U)
#define SEC_ENG_SE_TRNG_0_TEST_OUT_0_LEN    (32U)
#define SEC_ENG_SE_TRNG_0_TEST_OUT_0_MSK    (((1U << SEC_ENG_SE_TRNG_0_TEST_OUT_0_LEN) - 1) << SEC_ENG_SE_TRNG_0_TEST_OUT_0_POS)
#define SEC_ENG_SE_TRNG_0_TEST_OUT_0_UMSK   (~(((1U << SEC_ENG_SE_TRNG_0_TEST_OUT_0_LEN) - 1) << SEC_ENG_SE_TRNG_0_TEST_OUT_0_POS))

/* 0x244 : se_trng_0_test_out_1 */
#define SEC_ENG_SE_TRNG_0_TEST_OUT_1_OFFSET (0x244)
#define SEC_ENG_SE_TRNG_0_TEST_OUT_1        SEC_ENG_SE_TRNG_0_TEST_OUT_1
#define SEC_ENG_SE_TRNG_0_TEST_OUT_1_POS    (0U)
#define SEC_ENG_SE_TRNG_0_TEST_OUT_1_LEN    (32U)
#define SEC_ENG_SE_TRNG_0_TEST_OUT_1_MSK    (((1U << SEC_ENG_SE_TRNG_0_TEST_OUT_1_LEN) - 1) << SEC_ENG_SE_TRNG_0_TEST_OUT_1_POS)
#define SEC_ENG_SE_TRNG_0_TEST_OUT_1_UMSK   (~(((1U << SEC_ENG_SE_TRNG_0_TEST_OUT_1_LEN) - 1) << SEC_ENG_SE_TRNG_0_TEST_OUT_1_POS))

/* 0x248 : se_trng_0_test_out_2 */
#define SEC_ENG_SE_TRNG_0_TEST_OUT_2_OFFSET (0x248)
#define SEC_ENG_SE_TRNG_0_TEST_OUT_2        SEC_ENG_SE_TRNG_0_TEST_OUT_2
#define SEC_ENG_SE_TRNG_0_TEST_OUT_2_POS    (0U)
#define SEC_ENG_SE_TRNG_0_TEST_OUT_2_LEN    (32U)
#define SEC_ENG_SE_TRNG_0_TEST_OUT_2_MSK    (((1U << SEC_ENG_SE_TRNG_0_TEST_OUT_2_LEN) - 1) << SEC_ENG_SE_TRNG_0_TEST_OUT_2_POS)
#define SEC_ENG_SE_TRNG_0_TEST_OUT_2_UMSK   (~(((1U << SEC_ENG_SE_TRNG_0_TEST_OUT_2_LEN) - 1) << SEC_ENG_SE_TRNG_0_TEST_OUT_2_POS))

/* 0x24C : se_trng_0_test_out_3 */
#define SEC_ENG_SE_TRNG_0_TEST_OUT_3_OFFSET (0x24C)
#define SEC_ENG_SE_TRNG_0_TEST_OUT_3        SEC_ENG_SE_TRNG_0_TEST_OUT_3
#define SEC_ENG_SE_TRNG_0_TEST_OUT_3_POS    (0U)
#define SEC_ENG_SE_TRNG_0_TEST_OUT_3_LEN    (32U)
#define SEC_ENG_SE_TRNG_0_TEST_OUT_3_MSK    (((1U << SEC_ENG_SE_TRNG_0_TEST_OUT_3_LEN) - 1) << SEC_ENG_SE_TRNG_0_TEST_OUT_3_POS)
#define SEC_ENG_SE_TRNG_0_TEST_OUT_3_UMSK   (~(((1U << SEC_ENG_SE_TRNG_0_TEST_OUT_3_LEN) - 1) << SEC_ENG_SE_TRNG_0_TEST_OUT_3_POS))

/* 0x2FC : se_trng_0_ctrl_prot */
#define SEC_ENG_SE_TRNG_0_CTRL_PROT_OFFSET (0x2FC)
#define SEC_ENG_SE_TRNG_PROT_EN            SEC_ENG_SE_TRNG_PROT_EN
#define SEC_ENG_SE_TRNG_PROT_EN_POS        (0U)
#define SEC_ENG_SE_TRNG_PROT_EN_LEN        (1U)
#define SEC_ENG_SE_TRNG_PROT_EN_MSK        (((1U << SEC_ENG_SE_TRNG_PROT_EN_LEN) - 1) << SEC_ENG_SE_TRNG_PROT_EN_POS)
#define SEC_ENG_SE_TRNG_PROT_EN_UMSK       (~(((1U << SEC_ENG_SE_TRNG_PROT_EN_LEN) - 1) << SEC_ENG_SE_TRNG_PROT_EN_POS))
#define SEC_ENG_SE_TRNG_ID0_EN             SEC_ENG_SE_TRNG_ID0_EN
#define SEC_ENG_SE_TRNG_ID0_EN_POS         (1U)
#define SEC_ENG_SE_TRNG_ID0_EN_LEN         (1U)
#define SEC_ENG_SE_TRNG_ID0_EN_MSK         (((1U << SEC_ENG_SE_TRNG_ID0_EN_LEN) - 1) << SEC_ENG_SE_TRNG_ID0_EN_POS)
#define SEC_ENG_SE_TRNG_ID0_EN_UMSK        (~(((1U << SEC_ENG_SE_TRNG_ID0_EN_LEN) - 1) << SEC_ENG_SE_TRNG_ID0_EN_POS))
#define SEC_ENG_SE_TRNG_ID1_EN             SEC_ENG_SE_TRNG_ID1_EN
#define SEC_ENG_SE_TRNG_ID1_EN_POS         (2U)
#define SEC_ENG_SE_TRNG_ID1_EN_LEN         (1U)
#define SEC_ENG_SE_TRNG_ID1_EN_MSK         (((1U << SEC_ENG_SE_TRNG_ID1_EN_LEN) - 1) << SEC_ENG_SE_TRNG_ID1_EN_POS)
#define SEC_ENG_SE_TRNG_ID1_EN_UMSK        (~(((1U << SEC_ENG_SE_TRNG_ID1_EN_LEN) - 1) << SEC_ENG_SE_TRNG_ID1_EN_POS))

/* 0x300 : se_pka_0_ctrl_0 */
#define SEC_ENG_SE_PKA_0_CTRL_0_OFFSET      (0x300)
#define SEC_ENG_SE_PKA_0_DONE               SEC_ENG_SE_PKA_0_DONE
#define SEC_ENG_SE_PKA_0_DONE_POS           (0U)
#define SEC_ENG_SE_PKA_0_DONE_LEN           (1U)
#define SEC_ENG_SE_PKA_0_DONE_MSK           (((1U << SEC_ENG_SE_PKA_0_DONE_LEN) - 1) << SEC_ENG_SE_PKA_0_DONE_POS)
#define SEC_ENG_SE_PKA_0_DONE_UMSK          (~(((1U << SEC_ENG_SE_PKA_0_DONE_LEN) - 1) << SEC_ENG_SE_PKA_0_DONE_POS))
#define SEC_ENG_SE_PKA_0_DONE_CLR_1T        SEC_ENG_SE_PKA_0_DONE_CLR_1T
#define SEC_ENG_SE_PKA_0_DONE_CLR_1T_POS    (1U)
#define SEC_ENG_SE_PKA_0_DONE_CLR_1T_LEN    (1U)
#define SEC_ENG_SE_PKA_0_DONE_CLR_1T_MSK    (((1U << SEC_ENG_SE_PKA_0_DONE_CLR_1T_LEN) - 1) << SEC_ENG_SE_PKA_0_DONE_CLR_1T_POS)
#define SEC_ENG_SE_PKA_0_DONE_CLR_1T_UMSK   (~(((1U << SEC_ENG_SE_PKA_0_DONE_CLR_1T_LEN) - 1) << SEC_ENG_SE_PKA_0_DONE_CLR_1T_POS))
#define SEC_ENG_SE_PKA_0_BUSY               SEC_ENG_SE_PKA_0_BUSY
#define SEC_ENG_SE_PKA_0_BUSY_POS           (2U)
#define SEC_ENG_SE_PKA_0_BUSY_LEN           (1U)
#define SEC_ENG_SE_PKA_0_BUSY_MSK           (((1U << SEC_ENG_SE_PKA_0_BUSY_LEN) - 1) << SEC_ENG_SE_PKA_0_BUSY_POS)
#define SEC_ENG_SE_PKA_0_BUSY_UMSK          (~(((1U << SEC_ENG_SE_PKA_0_BUSY_LEN) - 1) << SEC_ENG_SE_PKA_0_BUSY_POS))
#define SEC_ENG_SE_PKA_0_EN                 SEC_ENG_SE_PKA_0_EN
#define SEC_ENG_SE_PKA_0_EN_POS             (3U)
#define SEC_ENG_SE_PKA_0_EN_LEN             (1U)
#define SEC_ENG_SE_PKA_0_EN_MSK             (((1U << SEC_ENG_SE_PKA_0_EN_LEN) - 1) << SEC_ENG_SE_PKA_0_EN_POS)
#define SEC_ENG_SE_PKA_0_EN_UMSK            (~(((1U << SEC_ENG_SE_PKA_0_EN_LEN) - 1) << SEC_ENG_SE_PKA_0_EN_POS))
#define SEC_ENG_SE_PKA_0_PROT_MD            SEC_ENG_SE_PKA_0_PROT_MD
#define SEC_ENG_SE_PKA_0_PROT_MD_POS        (4U)
#define SEC_ENG_SE_PKA_0_PROT_MD_LEN        (4U)
#define SEC_ENG_SE_PKA_0_PROT_MD_MSK        (((1U << SEC_ENG_SE_PKA_0_PROT_MD_LEN) - 1) << SEC_ENG_SE_PKA_0_PROT_MD_POS)
#define SEC_ENG_SE_PKA_0_PROT_MD_UMSK       (~(((1U << SEC_ENG_SE_PKA_0_PROT_MD_LEN) - 1) << SEC_ENG_SE_PKA_0_PROT_MD_POS))
#define SEC_ENG_SE_PKA_0_INT                SEC_ENG_SE_PKA_0_INT
#define SEC_ENG_SE_PKA_0_INT_POS            (8U)
#define SEC_ENG_SE_PKA_0_INT_LEN            (1U)
#define SEC_ENG_SE_PKA_0_INT_MSK            (((1U << SEC_ENG_SE_PKA_0_INT_LEN) - 1) << SEC_ENG_SE_PKA_0_INT_POS)
#define SEC_ENG_SE_PKA_0_INT_UMSK           (~(((1U << SEC_ENG_SE_PKA_0_INT_LEN) - 1) << SEC_ENG_SE_PKA_0_INT_POS))
#define SEC_ENG_SE_PKA_0_INT_CLR_1T         SEC_ENG_SE_PKA_0_INT_CLR_1T
#define SEC_ENG_SE_PKA_0_INT_CLR_1T_POS     (9U)
#define SEC_ENG_SE_PKA_0_INT_CLR_1T_LEN     (1U)
#define SEC_ENG_SE_PKA_0_INT_CLR_1T_MSK     (((1U << SEC_ENG_SE_PKA_0_INT_CLR_1T_LEN) - 1) << SEC_ENG_SE_PKA_0_INT_CLR_1T_POS)
#define SEC_ENG_SE_PKA_0_INT_CLR_1T_UMSK    (~(((1U << SEC_ENG_SE_PKA_0_INT_CLR_1T_LEN) - 1) << SEC_ENG_SE_PKA_0_INT_CLR_1T_POS))
#define SEC_ENG_SE_PKA_0_INT_SET            SEC_ENG_SE_PKA_0_INT_SET
#define SEC_ENG_SE_PKA_0_INT_SET_POS        (10U)
#define SEC_ENG_SE_PKA_0_INT_SET_LEN        (1U)
#define SEC_ENG_SE_PKA_0_INT_SET_MSK        (((1U << SEC_ENG_SE_PKA_0_INT_SET_LEN) - 1) << SEC_ENG_SE_PKA_0_INT_SET_POS)
#define SEC_ENG_SE_PKA_0_INT_SET_UMSK       (~(((1U << SEC_ENG_SE_PKA_0_INT_SET_LEN) - 1) << SEC_ENG_SE_PKA_0_INT_SET_POS))
#define SEC_ENG_SE_PKA_0_INT_MASK           SEC_ENG_SE_PKA_0_INT_MASK
#define SEC_ENG_SE_PKA_0_INT_MASK_POS       (11U)
#define SEC_ENG_SE_PKA_0_INT_MASK_LEN       (1U)
#define SEC_ENG_SE_PKA_0_INT_MASK_MSK       (((1U << SEC_ENG_SE_PKA_0_INT_MASK_LEN) - 1) << SEC_ENG_SE_PKA_0_INT_MASK_POS)
#define SEC_ENG_SE_PKA_0_INT_MASK_UMSK      (~(((1U << SEC_ENG_SE_PKA_0_INT_MASK_LEN) - 1) << SEC_ENG_SE_PKA_0_INT_MASK_POS))
#define SEC_ENG_SE_PKA_0_ENDIAN             SEC_ENG_SE_PKA_0_ENDIAN
#define SEC_ENG_SE_PKA_0_ENDIAN_POS         (12U)
#define SEC_ENG_SE_PKA_0_ENDIAN_LEN         (1U)
#define SEC_ENG_SE_PKA_0_ENDIAN_MSK         (((1U << SEC_ENG_SE_PKA_0_ENDIAN_LEN) - 1) << SEC_ENG_SE_PKA_0_ENDIAN_POS)
#define SEC_ENG_SE_PKA_0_ENDIAN_UMSK        (~(((1U << SEC_ENG_SE_PKA_0_ENDIAN_LEN) - 1) << SEC_ENG_SE_PKA_0_ENDIAN_POS))
#define SEC_ENG_SE_PKA_0_RAM_CLR_MD         SEC_ENG_SE_PKA_0_RAM_CLR_MD
#define SEC_ENG_SE_PKA_0_RAM_CLR_MD_POS     (13U)
#define SEC_ENG_SE_PKA_0_RAM_CLR_MD_LEN     (1U)
#define SEC_ENG_SE_PKA_0_RAM_CLR_MD_MSK     (((1U << SEC_ENG_SE_PKA_0_RAM_CLR_MD_LEN) - 1) << SEC_ENG_SE_PKA_0_RAM_CLR_MD_POS)
#define SEC_ENG_SE_PKA_0_RAM_CLR_MD_UMSK    (~(((1U << SEC_ENG_SE_PKA_0_RAM_CLR_MD_LEN) - 1) << SEC_ENG_SE_PKA_0_RAM_CLR_MD_POS))
#define SEC_ENG_SE_PKA_0_STATUS_CLR_1T      SEC_ENG_SE_PKA_0_STATUS_CLR_1T
#define SEC_ENG_SE_PKA_0_STATUS_CLR_1T_POS  (15U)
#define SEC_ENG_SE_PKA_0_STATUS_CLR_1T_LEN  (1U)
#define SEC_ENG_SE_PKA_0_STATUS_CLR_1T_MSK  (((1U << SEC_ENG_SE_PKA_0_STATUS_CLR_1T_LEN) - 1) << SEC_ENG_SE_PKA_0_STATUS_CLR_1T_POS)
#define SEC_ENG_SE_PKA_0_STATUS_CLR_1T_UMSK (~(((1U << SEC_ENG_SE_PKA_0_STATUS_CLR_1T_LEN) - 1) << SEC_ENG_SE_PKA_0_STATUS_CLR_1T_POS))
#define SEC_ENG_SE_PKA_0_STATUS             SEC_ENG_SE_PKA_0_STATUS
#define SEC_ENG_SE_PKA_0_STATUS_POS         (16U)
#define SEC_ENG_SE_PKA_0_STATUS_LEN         (16U)
#define SEC_ENG_SE_PKA_0_STATUS_MSK         (((1U << SEC_ENG_SE_PKA_0_STATUS_LEN) - 1) << SEC_ENG_SE_PKA_0_STATUS_POS)
#define SEC_ENG_SE_PKA_0_STATUS_UMSK        (~(((1U << SEC_ENG_SE_PKA_0_STATUS_LEN) - 1) << SEC_ENG_SE_PKA_0_STATUS_POS))

/* 0x30C : se_pka_0_seed */
#define SEC_ENG_SE_PKA_0_SEED_OFFSET (0x30C)
#define SEC_ENG_SE_PKA_0_SEED        SEC_ENG_SE_PKA_0_SEED
#define SEC_ENG_SE_PKA_0_SEED_POS    (0U)
#define SEC_ENG_SE_PKA_0_SEED_LEN    (32U)
#define SEC_ENG_SE_PKA_0_SEED_MSK    (((1U << SEC_ENG_SE_PKA_0_SEED_LEN) - 1) << SEC_ENG_SE_PKA_0_SEED_POS)
#define SEC_ENG_SE_PKA_0_SEED_UMSK   (~(((1U << SEC_ENG_SE_PKA_0_SEED_LEN) - 1) << SEC_ENG_SE_PKA_0_SEED_POS))

