Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/regs/sec_eng_reg.h
    /* 0x304  reserved */
    uint8_t RESERVED0x304[8];

    /* 0x30C : se_pka_0_seed */
    union {
        struct
        {
            uint32_t se_pka_0_seed : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } se_pka_0_seed;

    /* 0x310 : se_pka_0_ctrl_1 */
    union {
        struct
        {
            uint32_t se_pka_0_hburst  : 3;  /* [ 2: 0],        r/w,        0x5 */
            uint32_t se_pka_0_hbypass : 1;  /* [    3],        r/w,        0x0 */
            uint32_t reserved_4_31    : 28; /* [31: 4],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } se_pka_0_ctrl_1;

    /* 0x314  reserved */
    uint8_t RESERVED0x314[44];

    /* 0x340 : se_pka_0_rw */
    union {
        struct
        {
            uint32_t reserved_0_31 : 32; /* [31: 0],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } se_pka_0_rw;

    /* 0x344  reserved */
    uint8_t RESERVED0x344[28];

    /* 0x360 : se_pka_0_rw_burst */
    union {
        struct
        {
            uint32_t reserved_0_31 : 32; /* [31: 0],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } se_pka_0_rw_burst;

    /* 0x364  reserved */
    uint8_t RESERVED0x364[152];

    /* 0x3FC : se_pka_0_ctrl_prot */
    union {
        struct
        {
            uint32_t se_pka_prot_en : 1;  /* [    0],        r/w,        0x1 */
            uint32_t se_pka_id0_en  : 1;  /* [    1],        r/w,        0x1 */
            uint32_t se_pka_id1_en  : 1;  /* [    2],        r/w,        0x1 */
            uint32_t reserved_3_31  : 29; /* [31: 3],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } se_pka_0_ctrl_prot;

    /* 0x400 : se_cdet_0_ctrl_0 */
    union {
        struct
        {
            uint32_t se_cdet_0_en         : 1;  /* [    0],        r/w,        0x0 */
            uint32_t se_cdet_0_error      : 1;  /* [    1],          r,        0x0 */
            uint32_t se_cdet_0_status     : 14; /* [15: 2],          r,        0x1 */
            uint32_t se_cdet_0_g_loop_max : 8;  /* [23:16],        r/w,       0x64 */
            uint32_t se_cdet_0_g_loop_min : 8;  /* [31:24],        r/w,       0x21 */
        } BF;
        uint32_t WORD;
    } se_cdet_0_ctrl_0;

    /* 0x404 : se_cdet_0_ctrl_1 */
    union {
        struct
        {
            uint32_t se_cdet_0_t_loop_n : 8; /* [ 7: 0],        r/w,       0x32 */
            uint32_t se_cdet_0_t_dly_n  : 8; /* [15: 8],        r/w,        0x3 */
            uint32_t se_cdet_0_g_slp_n  : 8; /* [23:16],        r/w,       0xff */
            uint32_t reserved_24_31     : 8; /* [31:24],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } se_cdet_0_ctrl_1;

    /* 0x408  reserved */
    uint8_t RESERVED0x408[244];

    /* 0x4FC : se_cdet_0_ctrl_prot */
    union {
        struct
        {
            uint32_t se_cdet_prot_en : 1;  /* [    0],        r/w,        0x1 */
            uint32_t se_cdet_id0_en  : 1;  /* [    1],        r/w,        0x1 */
            uint32_t se_cdet_id1_en  : 1;  /* [    2],        r/w,        0x1 */
            uint32_t reserved_3_31   : 29; /* [31: 3],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } se_cdet_0_ctrl_prot;

    /* 0x500 : se_gmac_0_ctrl_0 */
    union {
        struct
        {
            uint32_t se_gmac_0_busy       : 1;  /* [    0],          r,        0x0 */
            uint32_t se_gmac_0_trig_1t    : 1;  /* [    1],        w1p,        0x0 */
            uint32_t se_gmac_0_en         : 1;  /* [    2],        r/w,        0x0 */
            uint32_t reserved_3_7         : 5;  /* [ 7: 3],       rsvd,        0x0 */
            uint32_t se_gmac_0_int        : 1;  /* [    8],          r,        0x0 */
            uint32_t se_gmac_0_int_clr_1t : 1;  /* [    9],        w1p,        0x0 */
            uint32_t se_gmac_0_int_set_1t : 1;  /* [   10],        w1p,        0x0 */
            uint32_t se_gmac_0_int_mask   : 1;  /* [   11],        r/w,        0x0 */
            uint32_t se_gmac_0_t_endian   : 1;  /* [   12],        r/w,        0x1 */
            uint32_t se_gmac_0_h_endian   : 1;  /* [   13],        r/w,        0x1 */
            uint32_t se_gmac_0_x_endian   : 1;  /* [   14],        r/w,        0x1 */
            uint32_t reserved_15_31       : 17; /* [31:15],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } se_gmac_0_ctrl_0;

    /* 0x504 : se_gmac_0_lca */
    union {
        struct
        {
            uint32_t se_gmac_0_lca : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } se_gmac_0_lca;

    /* 0x508 : se_gmac_0_status */
    union {
        struct
        {
            uint32_t se_gmac_0_status : 32; /* [31: 0],          r, 0xf1000000L */
        } BF;
        uint32_t WORD;
    } se_gmac_0_status;

    /* 0x50c  reserved */
    uint8_t RESERVED0x50c[240];

    /* 0x5FC : se_gmac_0_ctrl_prot */
    union {
        struct
        {
            uint32_t se_gmac_prot_en : 1;  /* [    0],        r/w,        0x1 */
            uint32_t se_gmac_id0_en  : 1;  /* [    1],        r/w,        0x1 */
            uint32_t se_gmac_id1_en  : 1;  /* [    2],        r/w,        0x1 */
            uint32_t reserved_3_31   : 29; /* [31: 3],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } se_gmac_0_ctrl_prot;

    /* 0x600  reserved */
    uint8_t RESERVED0x600[2304];

    /* 0xF00 : se_ctrl_prot_rd */
    union {
        struct
        {
            uint32_t se_sha_prot_en_rd  : 1; /* [    0],          r,        0x1 */
            uint32_t se_sha_id0_en_rd   : 1; /* [    1],          r,        0x1 */
            uint32_t se_sha_id1_en_rd   : 1; /* [    2],          r,        0x1 */
            uint32_t reserved_3         : 1; /* [    3],       rsvd,        0x0 */
            uint32_t se_aes_prot_en_rd  : 1; /* [    4],          r,        0x1 */
            uint32_t se_aes_id0_en_rd   : 1; /* [    5],          r,        0x1 */
            uint32_t se_aes_id1_en_rd   : 1; /* [    6],          r,        0x1 */
            uint32_t reserved_7         : 1; /* [    7],       rsvd,        0x0 */
            uint32_t se_trng_prot_en_rd : 1; /* [    8],          r,        0x1 */
            uint32_t se_trng_id0_en_rd  : 1; /* [    9],          r,        0x1 */
            uint32_t se_trng_id1_en_rd  : 1; /* [   10],          r,        0x1 */
            uint32_t reserved_11        : 1; /* [   11],       rsvd,        0x0 */
            uint32_t se_pka_prot_en_rd  : 1; /* [   12],          r,        0x1 */
            uint32_t se_pka_id0_en_rd   : 1; /* [   13],          r,        0x1 */
            uint32_t se_pka_id1_en_rd   : 1; /* [   14],          r,        0x1 */
            uint32_t reserved_15        : 1; /* [   15],       rsvd,        0x0 */
            uint32_t se_cdet_prot_en_rd : 1; /* [   16],          r,        0x1 */
            uint32_t se_cdet_id0_en_rd  : 1; /* [   17],          r,        0x1 */
            uint32_t se_cdet_id1_en_rd  : 1; /* [   18],          r,        0x1 */
            uint32_t reserved_19        : 1; /* [   19],       rsvd,        0x0 */
            uint32_t se_gmac_prot_en_rd : 1; /* [   20],          r,        0x1 */
            uint32_t se_gmac_id0_en_rd  : 1; /* [   21],          r,        0x1 */
            uint32_t se_gmac_id1_en_rd  : 1; /* [   22],          r,        0x1 */
            uint32_t reserved_23_30     : 8; /* [30:23],       rsvd,        0x0 */
            uint32_t se_dbg_dis         : 1; /* [   31],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_ctrl_prot_rd;

    /* 0xF04 : se_ctrl_reserved_0 */
    union {
        struct
        {
            uint32_t se_ctrl_reserved_0 : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } se_ctrl_reserved_0;

    /* 0xF08 : se_ctrl_reserved_1 */
    union {
        struct
        {
            uint32_t se_ctrl_reserved_1 : 32; /* [31: 0],        r/w, 0xffffffffL */
        } BF;
        uint32_t WORD;
    } se_ctrl_reserved_1;

    /* 0xF0C : se_ctrl_reserved_2 */
    union {
        struct
        {
            uint32_t se_ctrl_reserved_2 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_ctrl_reserved_2;
};

typedef volatile struct sec_eng_reg sec_eng_reg_t;

/*Following is reg patch*/

/* 0x0 : se_sha_ctrl */
#define SEC_ENG_SE_SHA_CTRL_OFFSET     (0x0)
#define SEC_ENG_SE_SHA_BUSY            SEC_ENG_SE_SHA_BUSY
#define SEC_ENG_SE_SHA_BUSY_POS        (0U)
#define SEC_ENG_SE_SHA_BUSY_LEN        (1U)
#define SEC_ENG_SE_SHA_BUSY_MSK        (((1U << SEC_ENG_SE_SHA_BUSY_LEN) - 1) << SEC_ENG_SE_SHA_BUSY_POS)
#define SEC_ENG_SE_SHA_BUSY_UMSK       (~(((1U << SEC_ENG_SE_SHA_BUSY_LEN) - 1) << SEC_ENG_SE_SHA_BUSY_POS))
#define SEC_ENG_SE_SHA_TRIG_1T         SEC_ENG_SE_SHA_TRIG_1T
#define SEC_ENG_SE_SHA_TRIG_1T_POS     (1U)
#define SEC_ENG_SE_SHA_TRIG_1T_LEN     (1U)
#define SEC_ENG_SE_SHA_TRIG_1T_MSK     (((1U << SEC_ENG_SE_SHA_TRIG_1T_LEN) - 1) << SEC_ENG_SE_SHA_TRIG_1T_POS)
#define SEC_ENG_SE_SHA_TRIG_1T_UMSK    (~(((1U << SEC_ENG_SE_SHA_TRIG_1T_LEN) - 1) << SEC_ENG_SE_SHA_TRIG_1T_POS))
#define SEC_ENG_SE_SHA_MODE            SEC_ENG_SE_SHA_MODE
#define SEC_ENG_SE_SHA_MODE_POS        (2U)
#define SEC_ENG_SE_SHA_MODE_LEN        (3U)
#define SEC_ENG_SE_SHA_MODE_MSK        (((1U << SEC_ENG_SE_SHA_MODE_LEN) - 1) << SEC_ENG_SE_SHA_MODE_POS)
#define SEC_ENG_SE_SHA_MODE_UMSK       (~(((1U << SEC_ENG_SE_SHA_MODE_LEN) - 1) << SEC_ENG_SE_SHA_MODE_POS))
#define SEC_ENG_SE_SHA_EN              SEC_ENG_SE_SHA_EN
#define SEC_ENG_SE_SHA_EN_POS          (5U)
#define SEC_ENG_SE_SHA_EN_LEN          (1U)
#define SEC_ENG_SE_SHA_EN_MSK          (((1U << SEC_ENG_SE_SHA_EN_LEN) - 1) << SEC_ENG_SE_SHA_EN_POS)
#define SEC_ENG_SE_SHA_EN_UMSK         (~(((1U << SEC_ENG_SE_SHA_EN_LEN) - 1) << SEC_ENG_SE_SHA_EN_POS))
#define SEC_ENG_SE_SHA_HASH_SEL        SEC_ENG_SE_SHA_HASH_SEL
#define SEC_ENG_SE_SHA_HASH_SEL_POS    (6U)
#define SEC_ENG_SE_SHA_HASH_SEL_LEN    (1U)
#define SEC_ENG_SE_SHA_HASH_SEL_MSK    (((1U << SEC_ENG_SE_SHA_HASH_SEL_LEN) - 1) << SEC_ENG_SE_SHA_HASH_SEL_POS)
#define SEC_ENG_SE_SHA_HASH_SEL_UMSK   (~(((1U << SEC_ENG_SE_SHA_HASH_SEL_LEN) - 1) << SEC_ENG_SE_SHA_HASH_SEL_POS))
#define SEC_ENG_SE_SHA_INT             SEC_ENG_SE_SHA_INT
#define SEC_ENG_SE_SHA_INT_POS         (8U)
#define SEC_ENG_SE_SHA_INT_LEN         (1U)
#define SEC_ENG_SE_SHA_INT_MSK         (((1U << SEC_ENG_SE_SHA_INT_LEN) - 1) << SEC_ENG_SE_SHA_INT_POS)
#define SEC_ENG_SE_SHA_INT_UMSK        (~(((1U << SEC_ENG_SE_SHA_INT_LEN) - 1) << SEC_ENG_SE_SHA_INT_POS))
#define SEC_ENG_SE_SHA_INT_CLR_1T      SEC_ENG_SE_SHA_INT_CLR_1T
#define SEC_ENG_SE_SHA_INT_CLR_1T_POS  (9U)
#define SEC_ENG_SE_SHA_INT_CLR_1T_LEN  (1U)
#define SEC_ENG_SE_SHA_INT_CLR_1T_MSK  (((1U << SEC_ENG_SE_SHA_INT_CLR_1T_LEN) - 1) << SEC_ENG_SE_SHA_INT_CLR_1T_POS)
#define SEC_ENG_SE_SHA_INT_CLR_1T_UMSK (~(((1U << SEC_ENG_SE_SHA_INT_CLR_1T_LEN) - 1) << SEC_ENG_SE_SHA_INT_CLR_1T_POS))
#define SEC_ENG_SE_SHA_INT_SET_1T      SEC_ENG_SE_SHA_INT_SET_1T
#define SEC_ENG_SE_SHA_INT_SET_1T_POS  (10U)
#define SEC_ENG_SE_SHA_INT_SET_1T_LEN  (1U)
#define SEC_ENG_SE_SHA_INT_SET_1T_MSK  (((1U << SEC_ENG_SE_SHA_INT_SET_1T_LEN) - 1) << SEC_ENG_SE_SHA_INT_SET_1T_POS)
#define SEC_ENG_SE_SHA_INT_SET_1T_UMSK (~(((1U << SEC_ENG_SE_SHA_INT_SET_1T_LEN) - 1) << SEC_ENG_SE_SHA_INT_SET_1T_POS))
#define SEC_ENG_SE_SHA_INT_MASK        SEC_ENG_SE_SHA_INT_MASK
#define SEC_ENG_SE_SHA_INT_MASK_POS    (11U)
#define SEC_ENG_SE_SHA_INT_MASK_LEN    (1U)
#define SEC_ENG_SE_SHA_INT_MASK_MSK    (((1U << SEC_ENG_SE_SHA_INT_MASK_LEN) - 1) << SEC_ENG_SE_SHA_INT_MASK_POS)
#define SEC_ENG_SE_SHA_INT_MASK_UMSK   (~(((1U << SEC_ENG_SE_SHA_INT_MASK_LEN) - 1) << SEC_ENG_SE_SHA_INT_MASK_POS))
#define SEC_ENG_SE_SHA_LINK_MODE       SEC_ENG_SE_SHA_LINK_MODE
#define SEC_ENG_SE_SHA_LINK_MODE_POS   (15U)
#define SEC_ENG_SE_SHA_LINK_MODE_LEN   (1U)
#define SEC_ENG_SE_SHA_LINK_MODE_MSK   (((1U << SEC_ENG_SE_SHA_LINK_MODE_LEN) - 1) << SEC_ENG_SE_SHA_LINK_MODE_POS)
#define SEC_ENG_SE_SHA_LINK_MODE_UMSK  (~(((1U << SEC_ENG_SE_SHA_LINK_MODE_LEN) - 1) << SEC_ENG_SE_SHA_LINK_MODE_POS))
#define SEC_ENG_SE_SHA_MSG_LEN         SEC_ENG_SE_SHA_MSG_LEN
#define SEC_ENG_SE_SHA_MSG_LEN_POS     (16U)
#define SEC_ENG_SE_SHA_MSG_LEN_LEN     (16U)
#define SEC_ENG_SE_SHA_MSG_LEN_MSK     (((1U << SEC_ENG_SE_SHA_MSG_LEN_LEN) - 1) << SEC_ENG_SE_SHA_MSG_LEN_POS)
#define SEC_ENG_SE_SHA_MSG_LEN_UMSK    (~(((1U << SEC_ENG_SE_SHA_MSG_LEN_LEN) - 1) << SEC_ENG_SE_SHA_MSG_LEN_POS))

/* 0x4 : se_sha_msa */
#define SEC_ENG_SE_SHA_MSA_OFFSET (0x4)
#define SEC_ENG_SE_SHA_MSA        SEC_ENG_SE_SHA_MSA
#define SEC_ENG_SE_SHA_MSA_POS    (0U)
#define SEC_ENG_SE_SHA_MSA_LEN    (32U)
#define SEC_ENG_SE_SHA_MSA_MSK    (((1U << SEC_ENG_SE_SHA_MSA_LEN) - 1) << SEC_ENG_SE_SHA_MSA_POS)
#define SEC_ENG_SE_SHA_MSA_UMSK   (~(((1U << SEC_ENG_SE_SHA_MSA_LEN) - 1) << SEC_ENG_SE_SHA_MSA_POS))

/* 0x8 : se_sha_status */
#define SEC_ENG_SE_SHA_STATUS_OFFSET (0x8)
#define SEC_ENG_SE_SHA_STATUS        SEC_ENG_SE_SHA_STATUS
#define SEC_ENG_SE_SHA_STATUS_POS    (0U)
#define SEC_ENG_SE_SHA_STATUS_LEN    (32U)
#define SEC_ENG_SE_SHA_STATUS_MSK    (((1U << SEC_ENG_SE_SHA_STATUS_LEN) - 1) << SEC_ENG_SE_SHA_STATUS_POS)
#define SEC_ENG_SE_SHA_STATUS_UMSK   (~(((1U << SEC_ENG_SE_SHA_STATUS_LEN) - 1) << SEC_ENG_SE_SHA_STATUS_POS))

/* 0xc : se_sha_endian */
#define SEC_ENG_SE_SHA_ENDIAN_OFFSET    (0xc)
#define SEC_ENG_SE_SHA_DOUT_ENDIAN      SEC_ENG_SE_SHA_DOUT_ENDIAN
#define SEC_ENG_SE_SHA_DOUT_ENDIAN_POS  (0U)
#define SEC_ENG_SE_SHA_DOUT_ENDIAN_LEN  (1U)
#define SEC_ENG_SE_SHA_DOUT_ENDIAN_MSK  (((1U << SEC_ENG_SE_SHA_DOUT_ENDIAN_LEN) - 1) << SEC_ENG_SE_SHA_DOUT_ENDIAN_POS)
#define SEC_ENG_SE_SHA_DOUT_ENDIAN_UMSK (~(((1U << SEC_ENG_SE_SHA_DOUT_ENDIAN_LEN) - 1) << SEC_ENG_SE_SHA_DOUT_ENDIAN_POS))

/* 0x10 : se_sha_hash_l_0 */
#define SEC_ENG_SE_SHA_HASH_L_0_OFFSET (0x10)
#define SEC_ENG_SE_SHA_HASH_L_0        SEC_ENG_SE_SHA_HASH_L_0
#define SEC_ENG_SE_SHA_HASH_L_0_POS    (0U)
#define SEC_ENG_SE_SHA_HASH_L_0_LEN    (32U)
#define SEC_ENG_SE_SHA_HASH_L_0_MSK    (((1U << SEC_ENG_SE_SHA_HASH_L_0_LEN) - 1) << SEC_ENG_SE_SHA_HASH_L_0_POS)
#define SEC_ENG_SE_SHA_HASH_L_0_UMSK   (~(((1U << SEC_ENG_SE_SHA_HASH_L_0_LEN) - 1) << SEC_ENG_SE_SHA_HASH_L_0_POS))

/* 0x14 : se_sha_hash_l_1 */
#define SEC_ENG_SE_SHA_HASH_L_1_OFFSET (0x14)
#define SEC_ENG_SE_SHA_HASH_L_1        SEC_ENG_SE_SHA_HASH_L_1
#define SEC_ENG_SE_SHA_HASH_L_1_POS    (0U)
#define SEC_ENG_SE_SHA_HASH_L_1_LEN    (32U)
#define SEC_ENG_SE_SHA_HASH_L_1_MSK    (((1U << SEC_ENG_SE_SHA_HASH_L_1_LEN) - 1) << SEC_ENG_SE_SHA_HASH_L_1_POS)
#define SEC_ENG_SE_SHA_HASH_L_1_UMSK   (~(((1U << SEC_ENG_SE_SHA_HASH_L_1_LEN) - 1) << SEC_ENG_SE_SHA_HASH_L_1_POS))

