Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/regs/sec_eng_reg.h
/* 0xc : se_trng_dout_1 */
#define SEC_ENG_SE_TRNG_DOUT_1_OFFSET (0xc)
#define SEC_ENG_SE_TRNG_DOUT_1        SEC_ENG_SE_TRNG_DOUT_1
#define SEC_ENG_SE_TRNG_DOUT_1_POS    (0U)
#define SEC_ENG_SE_TRNG_DOUT_1_LEN    (32U)
#define SEC_ENG_SE_TRNG_DOUT_1_MSK    (((1U << SEC_ENG_SE_TRNG_DOUT_1_LEN) - 1) << SEC_ENG_SE_TRNG_DOUT_1_POS)
#define SEC_ENG_SE_TRNG_DOUT_1_UMSK   (~(((1U << SEC_ENG_SE_TRNG_DOUT_1_LEN) - 1) << SEC_ENG_SE_TRNG_DOUT_1_POS))

/* 0x10 : se_trng_dout_2 */
#define SEC_ENG_SE_TRNG_DOUT_2_OFFSET (0x10)
#define SEC_ENG_SE_TRNG_DOUT_2        SEC_ENG_SE_TRNG_DOUT_2
#define SEC_ENG_SE_TRNG_DOUT_2_POS    (0U)
#define SEC_ENG_SE_TRNG_DOUT_2_LEN    (32U)
#define SEC_ENG_SE_TRNG_DOUT_2_MSK    (((1U << SEC_ENG_SE_TRNG_DOUT_2_LEN) - 1) << SEC_ENG_SE_TRNG_DOUT_2_POS)
#define SEC_ENG_SE_TRNG_DOUT_2_UMSK   (~(((1U << SEC_ENG_SE_TRNG_DOUT_2_LEN) - 1) << SEC_ENG_SE_TRNG_DOUT_2_POS))

/* 0x14 : se_trng_dout_3 */
#define SEC_ENG_SE_TRNG_DOUT_3_OFFSET (0x14)
#define SEC_ENG_SE_TRNG_DOUT_3        SEC_ENG_SE_TRNG_DOUT_3
#define SEC_ENG_SE_TRNG_DOUT_3_POS    (0U)
#define SEC_ENG_SE_TRNG_DOUT_3_LEN    (32U)
#define SEC_ENG_SE_TRNG_DOUT_3_MSK    (((1U << SEC_ENG_SE_TRNG_DOUT_3_LEN) - 1) << SEC_ENG_SE_TRNG_DOUT_3_POS)
#define SEC_ENG_SE_TRNG_DOUT_3_UMSK   (~(((1U << SEC_ENG_SE_TRNG_DOUT_3_LEN) - 1) << SEC_ENG_SE_TRNG_DOUT_3_POS))

/* 0x18 : se_trng_dout_4 */
#define SEC_ENG_SE_TRNG_DOUT_4_OFFSET (0x18)
#define SEC_ENG_SE_TRNG_DOUT_4        SEC_ENG_SE_TRNG_DOUT_4
#define SEC_ENG_SE_TRNG_DOUT_4_POS    (0U)
#define SEC_ENG_SE_TRNG_DOUT_4_LEN    (32U)
#define SEC_ENG_SE_TRNG_DOUT_4_MSK    (((1U << SEC_ENG_SE_TRNG_DOUT_4_LEN) - 1) << SEC_ENG_SE_TRNG_DOUT_4_POS)
#define SEC_ENG_SE_TRNG_DOUT_4_UMSK   (~(((1U << SEC_ENG_SE_TRNG_DOUT_4_LEN) - 1) << SEC_ENG_SE_TRNG_DOUT_4_POS))

/* 0x1c : se_trng_dout_5 */
#define SEC_ENG_SE_TRNG_DOUT_5_OFFSET (0x1c)
#define SEC_ENG_SE_TRNG_DOUT_5        SEC_ENG_SE_TRNG_DOUT_5
#define SEC_ENG_SE_TRNG_DOUT_5_POS    (0U)
#define SEC_ENG_SE_TRNG_DOUT_5_LEN    (32U)
#define SEC_ENG_SE_TRNG_DOUT_5_MSK    (((1U << SEC_ENG_SE_TRNG_DOUT_5_LEN) - 1) << SEC_ENG_SE_TRNG_DOUT_5_POS)
#define SEC_ENG_SE_TRNG_DOUT_5_UMSK   (~(((1U << SEC_ENG_SE_TRNG_DOUT_5_LEN) - 1) << SEC_ENG_SE_TRNG_DOUT_5_POS))

/* 0x20 : se_trng_dout_6 */
#define SEC_ENG_SE_TRNG_DOUT_6_OFFSET (0x20)
#define SEC_ENG_SE_TRNG_DOUT_6        SEC_ENG_SE_TRNG_DOUT_6
#define SEC_ENG_SE_TRNG_DOUT_6_POS    (0U)
#define SEC_ENG_SE_TRNG_DOUT_6_LEN    (32U)
#define SEC_ENG_SE_TRNG_DOUT_6_MSK    (((1U << SEC_ENG_SE_TRNG_DOUT_6_LEN) - 1) << SEC_ENG_SE_TRNG_DOUT_6_POS)
#define SEC_ENG_SE_TRNG_DOUT_6_UMSK   (~(((1U << SEC_ENG_SE_TRNG_DOUT_6_LEN) - 1) << SEC_ENG_SE_TRNG_DOUT_6_POS))

/* 0x24 : se_trng_dout_7 */
#define SEC_ENG_SE_TRNG_DOUT_7_OFFSET (0x24)
#define SEC_ENG_SE_TRNG_DOUT_7        SEC_ENG_SE_TRNG_DOUT_7
#define SEC_ENG_SE_TRNG_DOUT_7_POS    (0U)
#define SEC_ENG_SE_TRNG_DOUT_7_LEN    (32U)
#define SEC_ENG_SE_TRNG_DOUT_7_MSK    (((1U << SEC_ENG_SE_TRNG_DOUT_7_LEN) - 1) << SEC_ENG_SE_TRNG_DOUT_7_POS)
#define SEC_ENG_SE_TRNG_DOUT_7_UMSK   (~(((1U << SEC_ENG_SE_TRNG_DOUT_7_LEN) - 1) << SEC_ENG_SE_TRNG_DOUT_7_POS))

/* 0x28 : se_trng_test */
#define SEC_ENG_SE_TRNG_TEST_OFFSET     (0x28)
#define SEC_ENG_SE_TRNG_TEST_EN         SEC_ENG_SE_TRNG_TEST_EN
#define SEC_ENG_SE_TRNG_TEST_EN_POS     (0U)
#define SEC_ENG_SE_TRNG_TEST_EN_LEN     (1U)
#define SEC_ENG_SE_TRNG_TEST_EN_MSK     (((1U << SEC_ENG_SE_TRNG_TEST_EN_LEN) - 1) << SEC_ENG_SE_TRNG_TEST_EN_POS)
#define SEC_ENG_SE_TRNG_TEST_EN_UMSK    (~(((1U << SEC_ENG_SE_TRNG_TEST_EN_LEN) - 1) << SEC_ENG_SE_TRNG_TEST_EN_POS))
#define SEC_ENG_SE_TRNG_CP_TEST_EN      SEC_ENG_SE_TRNG_CP_TEST_EN
#define SEC_ENG_SE_TRNG_CP_TEST_EN_POS  (1U)
#define SEC_ENG_SE_TRNG_CP_TEST_EN_LEN  (1U)
#define SEC_ENG_SE_TRNG_CP_TEST_EN_MSK  (((1U << SEC_ENG_SE_TRNG_CP_TEST_EN_LEN) - 1) << SEC_ENG_SE_TRNG_CP_TEST_EN_POS)
#define SEC_ENG_SE_TRNG_CP_TEST_EN_UMSK (~(((1U << SEC_ENG_SE_TRNG_CP_TEST_EN_LEN) - 1) << SEC_ENG_SE_TRNG_CP_TEST_EN_POS))
#define SEC_ENG_SE_TRNG_CP_BYPASS       SEC_ENG_SE_TRNG_CP_BYPASS
#define SEC_ENG_SE_TRNG_CP_BYPASS_POS   (2U)
#define SEC_ENG_SE_TRNG_CP_BYPASS_LEN   (1U)
#define SEC_ENG_SE_TRNG_CP_BYPASS_MSK   (((1U << SEC_ENG_SE_TRNG_CP_BYPASS_LEN) - 1) << SEC_ENG_SE_TRNG_CP_BYPASS_POS)
#define SEC_ENG_SE_TRNG_CP_BYPASS_UMSK  (~(((1U << SEC_ENG_SE_TRNG_CP_BYPASS_LEN) - 1) << SEC_ENG_SE_TRNG_CP_BYPASS_POS))
#define SEC_ENG_SE_TRNG_HT_DIS          SEC_ENG_SE_TRNG_HT_DIS
#define SEC_ENG_SE_TRNG_HT_DIS_POS      (3U)
#define SEC_ENG_SE_TRNG_HT_DIS_LEN      (1U)
#define SEC_ENG_SE_TRNG_HT_DIS_MSK      (((1U << SEC_ENG_SE_TRNG_HT_DIS_LEN) - 1) << SEC_ENG_SE_TRNG_HT_DIS_POS)
#define SEC_ENG_SE_TRNG_HT_DIS_UMSK     (~(((1U << SEC_ENG_SE_TRNG_HT_DIS_LEN) - 1) << SEC_ENG_SE_TRNG_HT_DIS_POS))
#define SEC_ENG_SE_TRNG_HT_ALARM_N      SEC_ENG_SE_TRNG_HT_ALARM_N
#define SEC_ENG_SE_TRNG_HT_ALARM_N_POS  (4U)
#define SEC_ENG_SE_TRNG_HT_ALARM_N_LEN  (8U)
#define SEC_ENG_SE_TRNG_HT_ALARM_N_MSK  (((1U << SEC_ENG_SE_TRNG_HT_ALARM_N_LEN) - 1) << SEC_ENG_SE_TRNG_HT_ALARM_N_POS)
#define SEC_ENG_SE_TRNG_HT_ALARM_N_UMSK (~(((1U << SEC_ENG_SE_TRNG_HT_ALARM_N_LEN) - 1) << SEC_ENG_SE_TRNG_HT_ALARM_N_POS))

/* 0x2c : se_trng_ctrl_1 */
#define SEC_ENG_SE_TRNG_CTRL_1_OFFSET     (0x2c)
#define SEC_ENG_SE_TRNG_RESEED_N_LSB      SEC_ENG_SE_TRNG_RESEED_N_LSB
#define SEC_ENG_SE_TRNG_RESEED_N_LSB_POS  (0U)
#define SEC_ENG_SE_TRNG_RESEED_N_LSB_LEN  (32U)
#define SEC_ENG_SE_TRNG_RESEED_N_LSB_MSK  (((1U << SEC_ENG_SE_TRNG_RESEED_N_LSB_LEN) - 1) << SEC_ENG_SE_TRNG_RESEED_N_LSB_POS)
#define SEC_ENG_SE_TRNG_RESEED_N_LSB_UMSK (~(((1U << SEC_ENG_SE_TRNG_RESEED_N_LSB_LEN) - 1) << SEC_ENG_SE_TRNG_RESEED_N_LSB_POS))

/* 0x30 : se_trng_ctrl_2 */
#define SEC_ENG_SE_TRNG_CTRL_2_OFFSET     (0x30)
#define SEC_ENG_SE_TRNG_RESEED_N_MSB      SEC_ENG_SE_TRNG_RESEED_N_MSB
#define SEC_ENG_SE_TRNG_RESEED_N_MSB_POS  (0U)
#define SEC_ENG_SE_TRNG_RESEED_N_MSB_LEN  (16U)
#define SEC_ENG_SE_TRNG_RESEED_N_MSB_MSK  (((1U << SEC_ENG_SE_TRNG_RESEED_N_MSB_LEN) - 1) << SEC_ENG_SE_TRNG_RESEED_N_MSB_POS)
#define SEC_ENG_SE_TRNG_RESEED_N_MSB_UMSK (~(((1U << SEC_ENG_SE_TRNG_RESEED_N_MSB_LEN) - 1) << SEC_ENG_SE_TRNG_RESEED_N_MSB_POS))

/* 0x34 : se_trng_ctrl_3 */
#define SEC_ENG_SE_TRNG_CTRL_3_OFFSET (0x34)
#define SEC_ENG_SE_TRNG_CP_RATIO      SEC_ENG_SE_TRNG_CP_RATIO
#define SEC_ENG_SE_TRNG_CP_RATIO_POS  (0U)
#define SEC_ENG_SE_TRNG_CP_RATIO_LEN  (8U)
#define SEC_ENG_SE_TRNG_CP_RATIO_MSK  (((1U << SEC_ENG_SE_TRNG_CP_RATIO_LEN) - 1) << SEC_ENG_SE_TRNG_CP_RATIO_POS)
#define SEC_ENG_SE_TRNG_CP_RATIO_UMSK (~(((1U << SEC_ENG_SE_TRNG_CP_RATIO_LEN) - 1) << SEC_ENG_SE_TRNG_CP_RATIO_POS))
#define SEC_ENG_SE_TRNG_HT_RCT_C      SEC_ENG_SE_TRNG_HT_RCT_C
#define SEC_ENG_SE_TRNG_HT_RCT_C_POS  (8U)
#define SEC_ENG_SE_TRNG_HT_RCT_C_LEN  (8U)
#define SEC_ENG_SE_TRNG_HT_RCT_C_MSK  (((1U << SEC_ENG_SE_TRNG_HT_RCT_C_LEN) - 1) << SEC_ENG_SE_TRNG_HT_RCT_C_POS)
#define SEC_ENG_SE_TRNG_HT_RCT_C_UMSK (~(((1U << SEC_ENG_SE_TRNG_HT_RCT_C_LEN) - 1) << SEC_ENG_SE_TRNG_HT_RCT_C_POS))
#define SEC_ENG_SE_TRNG_HT_APT_C      SEC_ENG_SE_TRNG_HT_APT_C
#define SEC_ENG_SE_TRNG_HT_APT_C_POS  (16U)
#define SEC_ENG_SE_TRNG_HT_APT_C_LEN  (10U)
#define SEC_ENG_SE_TRNG_HT_APT_C_MSK  (((1U << SEC_ENG_SE_TRNG_HT_APT_C_LEN) - 1) << SEC_ENG_SE_TRNG_HT_APT_C_POS)
#define SEC_ENG_SE_TRNG_HT_APT_C_UMSK (~(((1U << SEC_ENG_SE_TRNG_HT_APT_C_LEN) - 1) << SEC_ENG_SE_TRNG_HT_APT_C_POS))
#define SEC_ENG_SE_TRNG_HT_OD_EN      SEC_ENG_SE_TRNG_HT_OD_EN
#define SEC_ENG_SE_TRNG_HT_OD_EN_POS  (26U)
#define SEC_ENG_SE_TRNG_HT_OD_EN_LEN  (1U)
#define SEC_ENG_SE_TRNG_HT_OD_EN_MSK  (((1U << SEC_ENG_SE_TRNG_HT_OD_EN_LEN) - 1) << SEC_ENG_SE_TRNG_HT_OD_EN_POS)
#define SEC_ENG_SE_TRNG_HT_OD_EN_UMSK (~(((1U << SEC_ENG_SE_TRNG_HT_OD_EN_LEN) - 1) << SEC_ENG_SE_TRNG_HT_OD_EN_POS))
#define SEC_ENG_SE_TRNG_ROSC_EN       SEC_ENG_SE_TRNG_ROSC_EN
#define SEC_ENG_SE_TRNG_ROSC_EN_POS   (31U)
#define SEC_ENG_SE_TRNG_ROSC_EN_LEN   (1U)
#define SEC_ENG_SE_TRNG_ROSC_EN_MSK   (((1U << SEC_ENG_SE_TRNG_ROSC_EN_LEN) - 1) << SEC_ENG_SE_TRNG_ROSC_EN_POS)
#define SEC_ENG_SE_TRNG_ROSC_EN_UMSK  (~(((1U << SEC_ENG_SE_TRNG_ROSC_EN_LEN) - 1) << SEC_ENG_SE_TRNG_ROSC_EN_POS))

